# Pandas
## from https://www.youtube.com/watch?v=dEFxoyJhm3Y&feature=youtu.be
### Чтение данных

In [52]:
import pandas as pd
import numpy as np

np.set_printoptions(precision=2)
pd.set_option('precision', 2)

In [53]:
data = pd.read_csv('../../data/beauty.csv',sep=';')

In [54]:
type(data)

pandas.core.frame.DataFrame

In [55]:
#читаем первый 5 записей
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [56]:
#размерность массива данных
data.shape

(1260, 10)

In [57]:
#краткая статистика по набору данных, есть ли пропуск и типы данных
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [58]:
#статистика по числовым признакам
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00,1260.00
mean,6.31,18.21,0.27,0.93,0.07,0.35,0.69,0.27,12.56,3.19
std,4.66,11.96,0.45,0.25,0.26,0.48,0.46,0.45,2.62,0.68
min,1.02,0.00,0.00,0.00,0.00,0.00,0.00,0.00,5.00,1.00
25%,3.71,8.00,0.00,1.00,0.00,0.00,0.00,0.00,12.00,3.00
50%,5.30,15.00,0.00,1.00,0.00,0.00,1.00,0.00,12.00,3.00
75%,7.70,27.00,1.00,1.00,0.00,1.00,1.00,1.00,13.00,4.00
max,77.72,48.00,1.00,1.00,1.00,1.00,1.00,1.00,17.00,5.00

In [59]:
#get all experiences
data['exper']

0       30
1       28
2       35
3       38
4       27
5       20
6       12
7        5
8        5
9       12
10       3
11       6
12      19
13       8
14      12
15      17
16       7
17      12
18      10
19       7
20       7
21      19
22      33
23      32
24      12
25      24
26      29
27      17
28      41
29      40
        ..
1230    18
1231    13
1232    36
1233     4
1234     8
1235    24
1236    31
1237    16
1238    10
1239    10
1240    12
1241    20
1242    13
1243     9
1244    15
1245    34
1246     8
1247     3
1248    19
1249    10
1250    13
1251     7
1252    21
1253    10
1254    20
1255    25
1256     4
1257    35
1258    15
1259    24
Name: exper, Length: 1260, dtype: int64

## loc & iloc

In [60]:
#посмотреть в срезе по выбранным индексам
data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [61]:
#5 строчек по вторым и третим столбцам
data.iloc[0:5,2:4]

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

## логические маски

In [62]:
#найти средний доход мужчин и женщин
data[data.female==1]['wage'].mean(), \
data[data.female==0]['wage'].mean()

(4.299357798165136, 7.3688228155339734)

In [63]:
data[(data.female==0) & (data.married==1)]['wage'].median(), \
data[(data.female==0) & (data.married==0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

In [74]:
for look,sub_df in data.groupby('looks'):
    print(sub_df['wage'].median())

3.46
4.595000000000001
5.635
5.24
4.81

In [78]:
#группируем по привлекательности и вытаскиваем среднюю по доходу и опыту работы
data.groupby('looks')[['wage','exper']].agg(np.median)

       wage  exper
looks
1      3.46   32.0
2      4.60   18.0
3      5.63   18.0
4      5.24   12.5
5      4.81    8.0

In [80]:
pd.crosstab(data['female'],data['married'])

married    0    1
female
0        166  658
1        223  213

In [82]:
#добавление нового признака
data['is_rich'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')

In [83]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [88]:
#просчитать среднее по всем столбцам
data.apply(np.mean)

wage         6.31
exper       18.21
union        0.27
goodhlth     0.93
black        0.07
female       0.35
married      0.69
service      0.27
educ        12.56
looks        3.19
is_rich      0.25
dtype: float64

In [90]:
def get_gender(female):
    return 'female' if female else 'male'

In [95]:
data['female'].apply(get_gender).head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object

In [98]:
#или с помощью лямбда функции
data['female'].apply(lambda female: 'female' if female else 'male').head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object

In [99]:
#создаем словарь
dic = {1:'union',0:'non-union'}

In [100]:
data['union'].map(dic).head()

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object

In [102]:
#посчитаем кол-во по признаку
data['married'].value_counts()

1    871
0    389
Name: married, dtype: int64

In [106]:
#sort
data.sort_values(by='wage',ascending=False).head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
602,77.72,9,1,1,1,1,1,1,13,4,1
269,41.67,16,0,0,0,0,1,0,13,4,1
415,38.86,29,0,1,0,0,1,0,13,3,1
69,32.79,33,0,1,0,0,1,1,16,4,1
290,31.09,32,0,0,0,0,1,0,13,3,1